#include <stdio.h>
int main(void) {

	// 대입연산자
	// 연산자 기준 오른쪽 값을 왼쪽 메모리에 할당함
	//---------------------------------
	int intResult = 0;
	double doubleResult = 0.0;

	// 산술 연산자 
	// ----------------

	// + 
	// -
	// *
	// /
	// %

	// 부호 연산자
	// + - 붙여
	// ------------------

	// 복합 대입 연산자
	// -----------------
	// 대입연산자
	intResult += 4;

	// 증감연산자 
	// a++ a-- 후위 증감
	// ++a --a 전위 증감

	//관계 연산자 
	// true = 1 false = 0
	//---------------

	// 논리 연산자
	// ------------------
	// && || !
	// 피연산자 두 개 따져 true = 1 false = 0

	// 비트 연산자
	// & | ~
	
}